# SQLAlchemy — Python Tutorial
[Source](https://towardsdatascience.com/sqlalchemy-python-tutorial-79a577141a91)

Other References
* [What are Object Relational Mappers (ORMs)](https://www.fullstackpython.com/object-relational-mappers-orms.html)
* [SQLAlchemy Basics](https://leportella.com/english/2019/01/10/sqlalchemy-basics-tutorial.html)

We often encounter data as Relational Databases. To work with them we generally would need to write raw SQL queries, pass them to the database engine and parse the returned results as a normal array of records.

SQLAlchemy provides a nice “Pythonic” way of interacting with databases. So rather than dealing with the differences between specific dialects of traditional SQL such as MySQL or PostgreSQL or Oracle, you can leverage the Pythonic framework of SQLAlchemy to streamline your workflow and more efficiently query your data.

In [ ]:
# Installing The Package
!pip install sqlalchemy

## Connecting to a database

To start interacting with the database we first we need to establish a connection.

```python
import sqlalchemy as db
engine = db.create_engine('dialect+driver://user:pass@host:port/db')
```

### Database connection examples

[Source](https://docs.sqlalchemy.org/en/13/core/engines.html#postgresql)

#### PostgreSQL

```python
# default
engine = create_engine('postgresql://scott:tiger@localhost/mydatabase')

# psycopg2
engine = create_engine('postgresql+psycopg2://scott:tiger@localhost/mydatabase')

# pg8000
engine = create_engine('postgresql+pg8000://scott:tiger@localhost/mydatabase')
```

#### MySQL

```python
# default
engine = create_engine('mysql://scott:tiger@localhost/foo')

# mysqlclient (a maintained fork of MySQL-Python)
engine = create_engine('mysql+mysqldb://scott:tiger@localhost/foo')

# PyMySQL
engine = create_engine('mysql+pymysql://scott:tiger@localhost/foo')
```

#### Oracle

```python
engine = create_engine('oracle://scott:tiger@127.0.0.1:1521/sidname')

engine = create_engine('oracle+cx_oracle://scott:tiger@tnsname')
```

#### Microsoft SQL Server

```python
# pyodbc
engine = create_engine('mssql+pyodbc://scott:tiger@mydsn')

# pymssql
engine = create_engine('mssql+pymssql://scott:tiger@hostname:port/dbname')
```

#### SQLite

```python
# sqlite://<nohostname>/<path>
# where <path> is relative:
engine = create_engine('sqlite:///foo.db')

# Unix/Mac - 4 initial slashes in total
engine = create_engine('sqlite:////absolute/path/to/foo.db')

# Windows
engine = create_engine('sqlite:///C:\\path\\to\\foo.db')

# Windows alternative using raw string
engine = create_engine(r'sqlite:///C:\path\to\foo.db')

# To use a SQLite :memory: database, specify an empty URL:
engine = create_engine('sqlite://')
```

## Viewing Table Details

SQLAlchemy can be used to automatically load tables from a database using something called reflection. Reflection is the process of reading the database and building the metadata based on that information.

In [60]:
import sqlalchemy as db

In [61]:
engine = db.create_engine('sqlite:///census.db')
connection = engine.connect()
metadata = db.MetaData()
census = db.Table('census', metadata, autoload=True, autoload_with=engine)

In [62]:
# Print the column names
print(census.columns.keys())

['state', 'sex', 'age', 'pop2000', 'pop2008']

In [63]:
# Print full table metadata
print(repr(metadata.tables['census']))

Table('census', MetaData(), Column('state', VARCHAR(length=30), table=<census>), Column('sex', VARCHAR(length=1), table=<census>), Column('age', INTEGER(), table=<census>), Column('pop2000', INTEGER(), table=<census>), Column('pop2008', INTEGER(), table=<census>), schema=None)

## Querying

```Table``` and ```MetaData``` have already been imported. The metadata is available as ```metadata```.

In [64]:
import sqlalchemy as db

In [65]:
engine = db.create_engine('sqlite:///census.db')
connection = engine.connect()
metadata = db.MetaData()
census = db.Table('census', metadata, autoload=True, autoload_with=engine)

In [66]:
#Equivalent to 'SELECT * FROM census'
query = db.select([census])

**ResultProxy**: The object returned by the ```.execute()``` method. It can be used in a variety of ways to get the data returned by the query.

In [67]:
ResultProxy = connection.execute(query)

**ResultSet**: The actual data asked for in the query when using a fetch method such as ```.fetchall()``` on a ResultProxy.

In [68]:
ResultSet = ResultProxy.fetchall()

In [69]:
ResultSet[:3]

[('Illinois', 'M', 0, 89600, 95012),
 ('Illinois', 'M', 1, 88445, 91829),
 ('Illinois', 'M', 2, 88729, 89547)]

### Dealing with Large ResultSet

We use ```.fetchmany()``` to load optimal no of rows and overcome memory issues in case of large datasets.

In [70]:
ResultProxy = connection.execute(query)
# ResultSet = ResultProxy.fetchall()
num_to_fetch = 3
partial_results = ResultProxy.fetchmany(num_to_fetch)
for i in range(num_to_fetch):
    print(partial_results[i])
ResultProxy.close()

('Illinois', 'M', 0, 89600, 95012)
('Illinois', 'M', 1, 88445, 91829)
('Illinois', 'M', 2, 88729, 89547)

### Convert to DataFrame

In [71]:
import pandas as pd

In [72]:
df = pd.DataFrame(ResultSet)
df.columns = ResultSet[0].keys()

In [73]:
df.head()

      state sex  age  pop2000  pop2008
0  Illinois   M    0    89600    95012
1  Illinois   M    1    88445    91829
2  Illinois   M    2    88729    89547
3  Illinois   M    3    88868    90037
4  Illinois   M    4    91947    91111

## Filtering data

Lets see some examples of raw SQLite Queries and queries using SQLAlchemy.

### where

**SQL**
```SQL
SELECT * FROM census 
WHERE sex = F
```

In [74]:
# SQLAlchemy
sql = db.select([census]).where(census.columns.sex == 'F')
print(sql)

SELECT census.state, census.sex, census.age, census.pop2000, census.pop2008
FROM census
WHERE census.sex = :sex_1

### in

**SQL**
```SQL
SELECT state, sex
FROM census
WHERE state IN (Texas, New York)
```

In [75]:
# SQLAlchemy
sql = db.select([census.columns.state, census.columns.sex]) \
    .where(census.columns.state.in_(['Texas', 'New York']))
print(sql)

SELECT census.state, census.sex
FROM census
WHERE census.state IN ([POSTCOMPILE_state_1])

### and, or, not

**SQL**
```SQL
SELECT * FROM census
WHERE state = 'California' AND NOT sex = 'M'
```

In [76]:
# SQLAlchemy
sql = db.select([census]) \
    .where(db.and_(census.columns.state == 'California', 
                   census.columns.sex != 'M'))
print(sql)

SELECT census.state, census.sex, census.age, census.pop2000, census.pop2008
FROM census
WHERE census.state = :state_1 AND census.sex != :sex_1

### order by

**SQL**
```SQL
SELECT * FROM census
ORDER BY State DESC, pop2000
```

In [77]:
# SQLAlchemy
sql = db.select([census]).order_by(
        db.desc(census.columns.state), 
        census.columns.pop2000)
print(sql)

SELECT census.state, census.sex, census.age, census.pop2000, census.pop2008
FROM census ORDER BY census.state DESC, census.pop2000

### functions

other functions include ```avg```, ```count```, ```min```, ```max```

**SQL**
```SQL
SELECT SUM(pop2008)
FROM census
```

In [78]:
# SQLAlchemy
query = db.select([db.func.sum(census.columns.pop2008)])
ResultSet = connection.execute(query).fetchall()
pd.DataFrame(ResultSet)

           0
0  302876613

### group by

**SQL**
```SQL
SELECT SUM(pop2008) as pop2008, sex
FROM census
GROUP BY sex
```

In [79]:
# SQLAlchemy
query = db.select([db.func.sum(census.columns.pop2008).label('pop2008'), 
           census.columns.sex]).group_by(census.columns.sex)
ResultSet = connection.execute(query).fetchall()
pd.DataFrame(ResultSet)

           0  1
0  153959198  F
1  148917415  M

### distinct

**SQL**
```SQL
SELECT DISTINCT state
FROM census
```

In [80]:
# SQLAlchemy
query = db.select([census.columns.state.distinct()])
ResultSet = connection.execute(query).fetchall()
pd.DataFrame(ResultSet)

                       0
0               Illinois
1             New Jersey
2   District of Columbia
3           North Dakota
4                Florida
5               Maryland
6                  Idaho
7          Massachusetts
8                 Oregon
9                 Nevada
10              Michigan
11             Wisconsin
12              Missouri
13            Washington
14        North Carolina
15               Arizona
16              Arkansas
17              Colorado
18               Indiana
19          Pennsylvania
20                Hawaii
21                Kansas
22             Louisiana
23               Alabama
24             Minnesota
25          South Dakota
26              New York
27            California
28           Connecticut
29                  Ohio
30          Rhode Island
31               Georgia
32        South Carolina
33                Alaska
34              Delaware
35             Tennessee
36               Vermont
37               Montana
38              Kentucky
39                  Utah
40              Nebraska
41         West Virginia
42                  Iowa
43               Wyoming
44                 Maine
45         New Hampshire
46           Mississippi
47              Oklahoma
48            New Mexico
49              Virginia
50                 Texas

### case & cast

The ```case()``` expression accepts a list of conditions to match and the column to return if the condition matches, followed by an ```else_``` if none of the conditions match.

```cast()``` function to convert an expression to a particular type

In [81]:
engine = db.create_engine('sqlite:///census.db')
connection = engine.connect()
metadata = db.MetaData()
census = db.Table('census', metadata, autoload=True, autoload_with=engine)

In [82]:
female_pop = db.func.sum(
    db.case([(census.columns.sex == 'F', census.columns.pop2000)],
            else_=0))
ResultSet = connection.execute(female_pop).fetchall()
pd.DataFrame(ResultSet)

           0
0  143534804

In [83]:
total_pop = db.cast(db.func.sum(census.columns.pop2000), db.Float)

In [84]:
query = db.select([female_pop/total_pop * 100])
ResultSet = connection.execute(query).fetchall()
pd.DataFrame(ResultSet)

           0
0  51.094674

In [85]:
result = connection.execute(query).scalar()
print(result)

51.09467432293413

We use ```.scalar``` to the result when the result contains only single value

### joins

If you have two tables that already have an established relationship, you can automatically use that relationship by just adding the columns we want from each table to the select statement.

```python
select([census.columns.pop2008, state_fact.columns.abbreviation])
```

In [86]:
engine = db.create_engine('sqlite:///census.db')
connection = engine.connect()
metadata = db.MetaData()

census = db.Table('census', metadata, autoload=True, autoload_with=engine)
state_fact = db.Table('state_fact', metadata, autoload=True, autoload_with=engine)

In [94]:
# Automatic Join
query = db.select([census.columns.pop2008, state_fact.columns.abbreviation])
results = connection.execute(query).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(5)

   pop2008 abbreviation
0    95012           IL
1    95012           NJ
2    95012           ND
3    95012           OR
4    95012           DC

In [101]:
# Manual Join
query = db.select([census.columns.pop2008, state_fact.columns.abbreviation]).join(state_fact, census.columns.state == state_fact.columns.name)
print(query)
results = connection.execute(query).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(5)

SELECT census.pop2008, state_fact.abbreviation
FROM census JOIN state_fact ON census.state = state_fact.name

   pop2008 abbreviation
0    95012           IL
1    91829           IL
2    89547           IL
3    90037           IL
4    91111           IL

In [102]:
# Manual Join
query = db.select([census, state_fact])
query = query.select_from(census.join(state_fact, census.columns.state == state_fact.columns.name))
results = connection.execute(query).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(5)

,state,sex,age,pop2000,pop2008,id,name,abbreviation,country,type,...,occupied,notes,fips_state,assoc_press,standard_federal_region,census_region,census_region_name,census_division,census_division_name,circuit_court
0,Illinois,M,0,89600,95012,13,Illinois,IL,USA,state,...,occupied,,17,Ill.,V,2,Midwest,3,East North Central,7
1,Illinois,M,1,88445,91829,13,Illinois,IL,USA,state,...,occupied,,17,Ill.,V,2,Midwest,3,East North Central,7
2,Illinois,M,2,88729,89547,13,Illinois,IL,USA,state,...,occupied,,17,Ill.,V,2,Midwest,3,East North Central,7
3,Illinois,M,3,88868,90037,13,Illinois,IL,USA,state,...,occupied,,17,Ill.,V,2,Midwest,3,East North Central,7
4,Illinois,M,4,91947,91111,13,Illinois,IL,USA,state,...,occupied,,17,Ill.,V,2,Midwest,3,East North Central,7

## Creating and Inserting Data into Tables

By passing the database which is not present, to the engine then sqlalchemy automatically creates a new database.

### Creating Database and Table

In [103]:
# delete the test database
import os
test_db_name = 'test.db'

if os.path.exists(test_db_name): 
    os.remove(test_db_name)

In [104]:
engine = db.create_engine(f'sqlite:///{test_db_name}') #Create test.db automatically
connection = engine.connect()
metadata = db.MetaData()

emp = db.Table('emp', metadata,
              db.Column('Id', db.Integer()),
              db.Column('name', db.String(255), nullable=False),
              db.Column('salary', db.Float(), default=100.0),
              db.Column('active', db.Boolean(), default=True)
              )

metadata.create_all(engine) #Creates the table

### Inserting Data

In [105]:
#Inserting record one by one
query = db.insert(emp).values(Id=1, name='naveen', salary=60000.00, active=True) 
ResultProxy = connection.execute(query)

In [106]:
#Inserting many records at ones
query = db.insert(emp) 
values_list = [{'Id':'2', 'name':'ram', 'salary':80000, 'active':False},
               {'Id':'3', 'name':'ramesh', 'salary':70000, 'active':True}]
ResultProxy = connection.execute(query, values_list)

In [107]:
results = connection.execute(db.select([emp])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(4)

   Id    name   salary  active
0   1  naveen  60000.0    True
1   2     ram  80000.0   False
2   3  ramesh  70000.0    True

### Updating data in Databases

```python
db.update(table_name).values(attribute = new_value).where(condition)
```

In [108]:
engine = db.create_engine(f'sqlite:///{test_db_name}')
metadata = db.MetaData()
connection = engine.connect()
emp = db.Table('emp', metadata, autoload=True, autoload_with=engine)

In [109]:
results = connection.execute(db.select([emp])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(4)

   Id    name   salary  active
0   1  naveen  60000.0    True
1   2     ram  80000.0   False
2   3  ramesh  70000.0    True

In [110]:
# Build a statement to update the salary to 100000
query = db.update(emp).values(salary = 100000)
query = query.where(emp.columns.Id == 1)
results = connection.execute(query)

In [111]:
results = connection.execute(db.select([emp])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(4)

   Id    name    salary  active
0   1  naveen  100000.0    True
1   2     ram   80000.0   False
2   3  ramesh   70000.0    True

### Delete Table

```python
db.delete(table_name).where(condition)
```

In [112]:
engine = db.create_engine(f'sqlite:///{test_db_name}')
metadata = db.MetaData()
connection = engine.connect()
emp = db.Table('emp', metadata, autoload=True, autoload_with=engine)

In [113]:
results = connection.execute(db.select([emp])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(4)

   Id    name    salary  active
0   1  naveen  100000.0    True
1   2     ram   80000.0   False
2   3  ramesh   70000.0    True

In [114]:
# Build a statement to delete where salary < 100000
query = db.delete(emp)
query = query.where(emp.columns.salary < 100000)
results = connection.execute(query)

In [115]:
results = connection.execute(db.select([emp])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(4)

   Id    name    salary  active
0   1  naveen  100000.0    True

### Dropping a Table

```python
table_name.drop(engine) #drops a single table

metadata.drop_all(engine) #drops all the tables in the database
```

In [116]:
engine = db.create_engine(f'sqlite:///{test_db_name}')
metadata = db.MetaData()
connection = engine.connect()

In [117]:
# drop a table
emp = db.Table('emp', metadata, autoload=True, autoload_with=engine)
emp.drop(engine)

In [118]:
# drop all tables
metadata.drop_all(engine)